'''

位运算符:按位运算符是把数字看做二进制来进行计算


'''

#& 按位与运算符
#相应的位数都为1，则该位的结果是1，否则为0
print(5 & 7)
'''
101
111
---
101

'''
# | 按位或运算符
#两个二进制位有一个为1时，结果为1


print(5|7)

'''
101
111
---
111

'''

#按位异或运算符
#二进制的两位相异时，结果为1，两位相同时为0
print(5^7)
'''
101
111
---
010
'''


#~按位取反运算符
#每个二进制数据位取反，1变0,0变1

print(~2)  #计算是按照补码进行计算的

'''
11111111111111111111111111111原码
10000000000000000000000000000反码，符号位不变
10000000000000000000000000001补码+1


'''
#>>右移运算符
#各进制位全部右移动若干位，由>>右侧的数字决定
print(-13>>2)
#000000001101
#000000000011
#右移补零