'''
表达式：由变量、常量和运算符组成的表达式

阅读表达式：
    功能；
    值；
'''

'''
算数运算符和算数表达式
+   -   *   /   %   **  //
加  减  乘   除  取模  求冥  取商

算术运算表达式
1 + 1  2*3  a/3
a = 10
功能：进行相关符号的数学运算。不会改变变量的值
值：相关的数学运算结果

'''
num1 = 5
num2 = 3
print(num1 + num2)
print(num1 - num2)
print(num1 * num2)
print(num1 / num2)
print(num1 % num2)
print(num1 ** num2)
print(num1 // num2)



'''
赋值运算符和赋值运算表达式

赋值运算符 = 

赋值运算表达式
格式：变量 = 表达式
功能： 计算了等号右侧“表达式”的值，并赋值给等号左侧的变量
值：赋值结束后变量的
'''

a = b = 1 + 2
num3 = num1 + num2

'''
符合运算符

+=  a += b  a = a + b
-=  
/=
%=
**=
//=


'''






