'''
逻辑运算符
'''

'''
逻辑与 and  

逻辑与运算表达式：表达式1 and 表达式2
值：如果表达式1的值为真，表达式2的值为真，整体逻辑与运算表达式的值为真
值：如果表达式1的值为真，表达式2的值为假，整体逻辑与运算表达式的值为假
值：如果表达式1的值为假，表达式2的值为真，整体逻辑与运算表达式的值为假
值：如果表达式1的值为假，表达式2的值为假，整体逻辑与运算表达式的值为假


'''

'''
短路原则
当逻辑与和逻辑或多个表达式的话 
表达式1 and 表达式2 and 表达式3 and 表达是4
只要遇到假就不计算后面的表达式了，得出结果为假，短路原则，同理逻辑或

'''



'''
逻辑或 or
逻辑或运算表达式： 表达式1 or 表达式2
值：
有真为真，全假为假


'''

'''
逻辑非运算表达式： not 表达式
值：
    假成真
    真变假
    
'''

'''
成员运算符：
in:如果在指定的序列中找到值返回true，否则返回False
not in:如果在制定的序列中没有找到值返回True,否则返回False

'''

'''
身份运算符

is:判断两个标识符是不是引用同一个对象
is not:判断两个标识符是不是引用不同对象
'''


